package com.example.study;

public class OpenApi {
    /**
     * OPEN API
     *  API란, Application Programming Interface의 약자로 응용 프로그램에서 사용할 수 있도록, 운영 체제나 프로그래밍 언어가
     *  제공하는 기능을 제어할 수 있게 만든 인터페이스를 뜻한다.
     *
     *  OPEN API란, 사용자가 제공되는 데이터를 자유롭게 활용할 수 있도록 만들어놓은 인터페이스이다.
     *
     *  우리나라는 공공데이터 포털에서 각종 데이터들을 API형태로 제공해주고 있는데, 그 밖에 다양한 사이트에서도 제공해준다.
     *
     *  API로 제공되어지는 형태는 대부분 JSON이나 XML로 제공된다.
     *
     *  데이터를 요청하면, 위 두형태로 결과를 얻을 수 있는데, 그냥 결과를 쓰기에는 어지롭고 지저분하다.
     *  그래서 얻은 결과를 사용할 수 있도록 사용자가 가공하는 과정을 거쳐야한다.
     *
     *
     */

}
