package com.example.study;

public class Spring {
    /**
     * 1. Spring이란 무엇인가 ?
     * Spring의 사전 정의 - 자바 플랫폼을 위한 오픈소스 애플리케이션 프레임워크
     *
     * 2. 프레임워크란 무엇인가 ?
     * FrameWork 사전적 정의 - 복잡한 문제를 해결하거나 서술하는 데 사용되는 기본 개념 구조
     * 너무 추상적으로 정의되어 있지 않냐는 생각을 하게 되었는데 읽어도 정말 직감적으로 1도 와닿지 않았습니다.
     * 그래서 추가적으로 프레임워크에 대한 검색을 좀 더 해봤더니 여러가지 자료들이 많이 나왔다.
     *
     * GOF의 디자인 패턴으로 유명한 Ralph Johnson 교수는 프레임워크를 아래와 같이 정의하였다고 합니다.
     *  - 소프트 웨어의 구체적인 부분에 해당하는 설계와 구현을 재사용이 가능하게끔 일련의 협업화된 형태로
     *  클래스들을 제공하는 것,  플랫폼을 위한 오픈소스 애플리케이션 프레임워크
     * 즉 쉽게 설명하자면 프레임워크란 우리의 개발을 용이하게 해주고 효율을 높여주는 도구라고 생각하면 될것 같다.
     * 그래도 와닿지 않는것은 여전하지만 말입니다. 물론 검색을 많이 해보면 정리가 정말 잘 되어있는 블로그도 많고 좋은 자료도 많지만,
     * 직감적으로 와닿지는 않기에 또한 여기서는 Spring MVC로 프로젝트를 진행하기 위한 기초적인 개념을 잡는 것이기에
     * 직접 개발에 들어가 겪어 보는 것이 자료만 무작정 읽는 것 보다는 좋을 것 같다는 생각을 하여 여기까지만 간단히 정리하고
     * 프로젝트 진행으로 넘어 가 겠습니다.
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     */
}
